Revit 2027 API
FormatOptions.IsValidSymbol Method
Overload List
Name | Description
IsValidSymbol(ForgeTypeId) |  Checks whether a symbol is valid for the unit in this FormatOptions.
IsValidSymbol(ForgeTypeId, ForgeTypeId) |  Checks whether a symbol is valid for a given unit.
Top
See Also
Reference
FormatOptions Class
Autodesk.Revit.DB Namespace